;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[PLASMAGUN_CV X2WeaponTemplate]
FriendlyName="MK-II狂怒之火型电浆枪"
FriendlyNamePlural="MK-II狂怒之火型电浆枪"
BriefSummary="MK-II狂怒之火型电浆枪是巴达布战争期间星际战士战团暗鸦守卫所使用的型号。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>MK-II狂怒之火型电浆枪是巴达布战争期间星际战士战团暗鸦守卫所使用的型号。"
AbilityDescName="电浆枪"

[PLASMAGUN_MG X2WeaponTemplate]
FriendlyName="MK-V火星型电浆枪"
FriendlyNamePlural="MK-V火星型电浆枪"
BriefSummary="星际战士战团黑暗天使和红蝎子使用MK-V火星型电浆枪。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>星际战士战团黑暗天使和红蝎子使用MK-V火星型电浆枪。"
AbilityDescName="电浆枪"

[PLASMAGUN_BM X2WeaponTemplate]
FriendlyName="MK-VI烈日白狼型电浆枪"
FriendlyNamePlural="MK-VI烈日白狼型电浆枪"
BriefSummary="电浆枪及其发射的炽烈能量在星际战士战团太空野狼中非常受欢迎，以狼眼的灼热之吻对敌人进行宽恕。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>电浆枪及其发射的炽烈能量在星际战士战团太空野狼中非常受欢迎，以狼眼的灼热之吻对敌人进行宽恕。"
AbilityDescName="电浆枪"
